{"pageProps":{"post":{"title":"Move All Balls to Each Box","slug":"move-balls-boxes","content":"<h1>Move All Balls to Each Box</h1>\n<p><a href=\"https://leetcode.com/problems/minimum-number-of-operations-to-move-all-balls-to-each-box/\">https://leetcode.com/problems/minimum-number-of-operations-to-move-all-balls-to-each-box/</a></p>\n<p>Te entregarán un <code>string</code> de longitud n. Cada caracter del string representa\nuna caja. Si en el caracter <code>i</code> hay un \"0\" entonces la caja está vacia. Si\nhay un \"1\" entonces la caja contiene una bola.</p>\n<p>Por ejemplo, el <code>string</code> \"110\", tiene longitud 3 y representa 3 cajas. En el\nprimer y segundo caracter (posición 0 y 1) es un \"1\" es decir la primera y\nsegunda caja tiene una bola cada una. El tercer caracter (posicón 2) tiene\nun \"0\" es decir la tercera caja está vacia.</p>\n<p>Se requiere entonces calcular para cada caja el mínimo número de movimientos\nnecesarios para mover todas las bolas a cada caja. En un movimiento sólo se\npueden mover una bola entre cajas adyacentes. La casilla i es adyacente a la j\nsi abs(i - j) == 1. Ten en cuenta que después de hacer esto, puede haber más\nde una bola en algunas casillas.</p>\n<p>Devuelve un array respuesta de tamaño n, donde respuesta[i] es el número mínimo\nde operaciones necesarias para mover todas las bolas a la iésima casilla.</p>\n<p>Por ejemplo, para el <code>string</code> \"110\", la respuesta es el <code>array</code> [1,1,3].</p>\n<ol>\n<li>\n<p>Primera caja: tendrás que mover una bola de la segunda caja a la primera\ncaja en una sola operación.</p>\n</li>\n<li>\n<p>Segunda caja: tendrás que mover una bola de la primera caja a la segunda\nen una sola operación.</p>\n</li>\n<li>\n<p>Tercera caja: tendrás que mover una bola de la primera caja a la tercera\ncaja en dos operaciones, y mover una bola de la segunda caja a la tercera caja\nen una operación.</p>\n</li>\n</ol>\n<p>Pista 1:</p>\n<p>Si quieres mover una bola de la caja i a la caja j, necesitarás\nmovimientos abs(i-j).</p>\n<p>Pista 2:</p>\n<p>Para mover todas las bolas a alguna caja, puedes moverlas una a una.</p>\n<p>Pista 3:</p>\n<p>Para cada casilla i, iterar sobre cada bola de una casilla j, y añadir abs(i-j)\na la posición i del <code>array</code> respuesta.</p>\n","projects":["data-lovers","memory match"],"OAs":["arrays"]}},"__N_SSG":true}