{"pageProps":{"post":{"title":"Who wins the card game?","slug":"who-wins-the-card-game","content":"<h1>Who wins the card game?</h1>\n<p><a href=\"https://www.codewars.com/kata/5a03157f8ba914fcf50000d4/train/javascript\">https://www.codewars.com/kata/5a03157f8ba914fcf50000d4/train/javascript</a></p>\n<p>Ben, Amy y Sam están jugando a las cartas.\nEs un poco como el blackjack, donde la persona cuyo puntaje es más cercano, pero\nno mayor a 21 es el ganador.</p>\n<p>Sin embargo, Ben, Amy y Sam pueden elegir una carta adicional si así lo desean.</p>\n<p>También han decidido que los Ases (A, K, Q, J) siempre son iguales a 10.</p>\n<p>Debes escribir una función que devuelva un array anidado de los jugadores y sus\npuntuaciones en el orden de ganador a perdedor.</p>\n<p><strong>Argumentos</strong></p>\n<ol>\n<li>\n<p>players: un objeto que contiene el nombre de cada jugador y sus cartas.\nCada jugador deberá tener sus cartas agregadas para calcular su puntaje actual.</p>\n</li>\n<li>\n<p>extraCard: una tarjeta adicional cuyo valor deberá agregarse a las\npuntuaciones de ciertos jugadores. (Puede ser un string o un number)</p>\n</li>\n<li>\n<p>extraTakers: array que contiene los nombres de los jugadores que eligen que\nel valor de extraCard se agregue a su puntuación.</p>\n</li>\n</ol>\n<p><strong>Reglas</strong></p>\n<ol>\n<li>\n<p>La persona cuyo nombre está en el segundo argumento debe tener el valor de la\ntarjeta adicional agregado a su puntaje.</p>\n</li>\n<li>\n<p>Si hay un empate, los jugadores con la misma puntuación deben presentarse en\norden alfabético. Ejemplo: si Ben y Sam tienen una puntuación de 10, Ben debe\nescribirse primero.</p>\n</li>\n<li>\n<p>Todas las tarjetas con imágenes (A, K, Q, J) son iguales a 10</p>\n</li>\n<li>\n<p>Si la puntuación de un jugador supera los 21, no puede ganar.</p>\n</li>\n</ol>\n<p><strong>Ejemplo</strong></p>\n<pre><code class=\"language-js\">const players = {\n  \"Ben\" : \"5, 2\",\n  \"Amy\" : \"4, 3\",\n  \"Sam\" : \"3, 10\",\n};\n\nwhoWins(players, 3, [\"Ben\", \"Amy\"])\n//debería retornar\n[[\"Sam\", 13], [\"Amy\", 10], [\"Ben\", 10]];\n</code></pre>\n<h2>Objetivos de aprendizaje (OAs)</h2>\n<ul>\n<li>Métodos de arrays</li>\n<li>Objetos (key, value)</li>\n</ul>\n"}},"__N_SSG":true}