{"pageProps":{"post":{"title":"Job Matching","slug":"job-matching","content":"<h1>Job Matching</h1>\n<p><a href=\"https://www.codewars.com/kata/56c22c5ae8b139416c00175d/train/javascript\">https://www.codewars.com/kata/56c22c5ae8b139416c00175d/train/javascript</a></p>\n<p>Construyamos un sistema de coincidencias que ayude a descubrir trabajos para\ndesarrolladoras en función de una serie de factores.</p>\n<p>Uno de los factores más sencillos, pero más importantes, es la remuneración.\nComo desarrolladoras sabemos cuánto dinero necesitamos para mantener nuestro\nestilo de vida, así que generalmente tenemos una idea aproximada del salario\nmínimo con el que estaríamos satisfechas.</p>\n<p>Manos al código!!. Vamos a crear una función match que toma una candidata y un\ntrabajo, que devolverá un booleano indicando si el trabajo es una coincidencia\nválida para la candidata.</p>\n<p>Una candidata tendrá un salario mínimo, por lo que se verá así:</p>\n<pre><code class=\"language-js\">let candidate = {\n  minSalary: 120000\n}\n</code></pre>\n<p>Un puesto de trabajo tendrá un salario máximo, por lo que se verá así:</p>\n<pre><code class=\"language-js\">let job = {\n  maxSalary: 140000\n}\n</code></pre>\n<p>Para que la coincidencia sea válida, el salario máximo del puesto de trabajo\ndebe ser mayor o igual al salario deseado por la candidata. También incluye la\nposibilidad que la candidata reduzca un 10% su salario deseado para llegar a un\nacuerdo con la empresa.</p>\n<p><strong>Ejemplo</strong></p>\n<pre><code class=\"language-js\">Entradas: {minSalary:190000} {maxSalary:171000}\nSalida: true\nExplicación: \"La candidata establece un salario deseado de 190000 menos 19000 correspondientes al 10% de margen nos quedan 171000 y esto es igual al salario máximo de 171000 por lo tanto retornamos true\"\n</code></pre>\n<blockquote>\n<p><strong>Importante</strong> ❗</p>\n<p>En ocasiones el se olvidan de poner algunos valores...<br>\nSi el salario mínimo de la candidata o el salario máximo del puesto no están\npresentes, lanza un error.</p>\n</blockquote>\n","projects":["data lovers","memory match","emergency room"],"OAs":["objects"]}},"__N_SSG":true}